[
  {
    "id": "1",
    "poster": "../img/posters/minecraft.jpg",
    "title": "Minecraft: Movie",
    "releaseDate": "2025-03-30",
    "country": "USA",
    "duration": "142 minutes",
    "ageRestriction": "3+",
    "genres": ["Adventures", "Comedy"],

    "ratings": {
      "imdb": 9.3,
      "rottenTomatoes": 91
    },
    "description": "Welcome to the world of Minecraft! Creativity here not only helps you craft, but is essential to your existence! Garrett “Scavenger” Garrison, Henry, Natalie, and Don are four misfits who are trying to solve their everyday problems. But one day, after passing through a mysterious portal, they find themselves in the Upper World, a bizarre cubic wonderland that thrives on imagination. To get back home, they will have to explore this world (and protect it from evil creatures like Piggles and Zombies). To do this, the heroes will go on a magical quest with a new friend, an experienced wizard named Steve. The joint adventure will test all five of them for courage and give them the opportunity to discover the unique skills that make each of them a unique creator... the very skills they need to succeed in the real world.",
    "trailerLink": "https://www.youtube.com/watch?v=wJO_vIDZn-I"
  },
  {
    "id": "2",
    "poster": "../img/posters/superbaby.jpg",
    "title": "SuperBaby",
    "releaseDate": "2025-04-05",
    "country": "USA",
    "duration": "152 minutes",
    "ageRestriction": "3+",
    "genres": ["Adventures", "Comedy", "Drama"],
    "ratings": {
      "imdb": 9.0,
      "rottenTomatoes": 94
    },
    "description": "A comedy animated superblockbuster for the whole family based on the world bestseller Some Superheroes Wear Diapers! Willy has always dreamed of becoming a superhero and fighting criminals with his policeman father. However, suddenly a newborn brother Charlie appears in the family. Not only does the baby get all the attention, but it turns out that Charlie has superpowers.Meanwhile, a supervillain and a mad scientist have decided to finally realize their sinister plan. So the baby with superpowers and his older brother have to team up to save the city!",
    "trailerLink": "https://www.youtube.com/watch?v=C_7ESFuQhdE"
  },
  {
    "id": "3",
    "poster": "../img/posters/unteldown.jpg",
    "title": "UNTIL DAWN",
    "releaseDate": "2025-04-11",
    "country": "USA",
    "duration": "132 minutes",
    "ageRestriction": "13+",
    "genres": ["Thriller", "Drama", "Horror"],
    "ratings": {
      "imdb": 8.5,
      "rottenTomatoes": 99
    },
    "description": "A year after the mysterious disappearance of his sister, Clover and his friends travel to a remote valley to find answers. In an abandoned tourist center, they are stalked by a masked killer. One by one, they die a horrible death... and each time they wake up at the beginning of the same night. The killer changes his tactics every time, and the friends realize that their deaths are not endless. The only chance to survive is to hold out until dawn.",
    "trailerLink": "https://www.youtube.com/watch?v=2b3vBaINZ7w"
  },
  {
    "id": "4",
    "poster": "../img/posters/auditor2.jpg",
    "title": "The Auditor 2",
    "releaseDate": "2025-05-17",
    "country": "USA",
    "duration": "201 minutes",
    "ageRestriction": "18+",
    "genres": ["Drama", "Adventures", "Thriller"],
    "ratings": {
      "imdb": 9.0,
      "rottenTomatoes": 93
    },
    "description": "Christian Wolff (Ben Affleck) has a talent for solving complex problems. The murderers of his old friend leave behind a cryptic message: “Find the auditor.” Wolff begins to investigate, but realizes that he needs more radical methods. He turns to his dangerous brother Brax (Jon Bernthal) for help. Together with Marybeth Medina (Cynthia Addai-Robinson), the deputy director of the US Treasury Department, they uncover a sinister plot, but become the targets of a ruthless organization of assassins who are willing to do anything to hide their secrets.",
    "trailerLink": "https://www.youtube.com/watch?v=2b3vBaINZ7w"
  },
  {
    "id": "5",
    "poster": "../img/posters/sinners.jpg",
    "title": "The Sinners",
    "releaseDate": "2025-04-14",
    "country": "USA",
    "duration": "169 minutes",
    "ageRestriction": "16+",
    "genres": ["Drama", "Horror", "Thriller"],
    "ratings": {
      "imdb": 8.7,
      "rottenTomatoes": 73
    },
    "description": "Twin brothers Elijah and Elias (Michael B. Jordan) return to their hometown after a long absence. Their lives have never been easy, and now they hope to find the peace they desire. However, their plans are not destined to be realized, because something awaits them at home that will radically change their lives and aspirations. At home, the brothers are in for a much bigger and more ominous disaster than they could have ever imagined.",
    "trailerLink": "https://www.youtube.com/watch?v=bKGxHflevuk"
  },
  {
    "id": "6",
    "poster": "../img/posters/loked.jpg",
    "title": "Locked up",
    "releaseDate": "2025-12-07",
    "country": "USA",
    "duration": "128 minutes",
    "ageRestriction": "16+",
    "genres": ["Drama", "Horror", "Thriller"],
    "ratings": {
      "imdb": 8.2,
      "rottenTomatoes": 89
    },
    "description": "It was supposed to be a simple theft, but how wrong he was. The thief breaks into a luxury SUV, but the doors lock and he finds himself trapped in a deadly game. He is contacted by a mysterious stranger who sees his every move and offers him a choice: survive or pay for his sins. In this machine, there are no accidents, no rules, and no way out",
    "trailerLink": "https://www.youtube.com/watch?v=Cf8rW_Kp_9M"
  },
  {
    "id": "7",
    "poster": "../img/posters/karatekid.jpg",
    "title": "Karate Kid: Legends",
    "releaseDate": "2025-05-02",
    "country": "USA",
    "duration": "95 minutes",
    "ageRestriction": "6+",
    "genres": ["Animation", "Musical", "Comedy"],
    "ratings": {
      "imdb": 7.5,
      "rottenTomatoes": 85
    },
    "description": "After a family tragedy, young kung fu master Li Fan is forced to leave his home in Beijing and move to New York with his mother. Li tries to leave his past behind and find his place among his new classmates. But even though he doesn't want to fight, trouble follows him everywhere. When a new friend needs his help, Lee enters a karate competition - but skill alone is not enough to win. Lee's teacher, Mr. Han, turns to the real Karate Kid, Daniel LaRusso, for help. So, Lee discovers a new approach to combat, combining two styles into one for the ultimate martial arts fight.",
    "trailerLink": "https://www.youtube.com/watch?v=LhRXf-yEQqA"
  },
  {
    "id": "8",
    "poster": "../img/posters/sister.jpg",
    "title": "Two sisters",
    "releaseDate": "2025-04-08",
    "country": "Ukraine",
    "duration": "140 minutes",
    "ageRestriction": "16+",
    "genres": ["Adventure", "Action", "Drama"],
    "ratings": {
      "imdb": 8.8,
      "rottenTomatoes": 92
    },
    "description": "Yashmina and Malgorzata are half-sisters who have long since stopped communicating. But the news that their father has been wounded in Ukraine forces the sisters to go in search of him together in the war-torn country. During the journey, they meet Ukrainians, go through various trials and life-changing experiences that help them to become closer, reassess their values, and finally understand each other.",
    "trailerLink": "https://www.youtube.com/watch?v=s9ywvlfcdxg"
  },
  {
    "id": "9",
    "poster": "../img/posters/karpat.jpg",
    "title": "Eyes. The legend of the Carpathians",
    "releaseDate": "2025-04-10",
    "country": "United Kingdom",
    "duration": "115 minutes",
    "ageRestriction": "3+",
    "genres": ["Fantasy", "Adventure", "Action"],
    "ratings": {
      "imdb": 7.9,
      "rottenTomatoes": 87
    },
    "description": "In the middle of the Carpathian Mountains, there is a remote village where people are used to listening to every rustle coming from the forest. Shy Yulia (Helena Zengel) grows up with her father Maxim (Willem Dafoe). Boys from other families are given to him to raise, so that he can teach them the rules of survival in these parts. It's about hunting for terrible creatures hiding in the forest. One day, during a regular training session with her father, Yulia comes across a frightened, confused cub of an unknown animal. The girl begins to take care of the baby and finds that she even knows how to speak like the baby. Taking care of the baby's future, Yulia wants to return it to her family. The fantasy family movie “EYES: THE LEGEND OF THE CARPATHIANS was co-produced by the United States, Finland and the United Kingdom. The novice filmmaker Isaiah Sexon wrote the script and directed it himself. The main filming took place in Romania. The baby otter that appears on the screen is a puppet that was controlled by seven people at the same time during the filming. Special attention was also paid to the sounds that the eyes communicate with.",
    "trailerLink": "https://www.youtube.com/watch?v=_jTFLg3arYU"
  },
  {
    "id": "10",
    "poster": "../img/posters/race.jpg",
    "title": "Flight overhead",
    "releaseDate": "2025-04-15",
    "country": "USA",
    "duration": "110 minutes",
    "ageRestriction": "13+",
    "genres": ["Romance", "Action", "Comedy"],
    "ratings": {
      "imdb": 8.6,
      "rottenTomatoes": 95
    },
    "description": "The mercenary Lucas (Josh Hartnett) wants to quit, but his bosses give him one last assignment: to track and escort a target on an airplane. However, the situation becomes much more complicated when it turns out that the plane is full of crazed assassins, all of whom have Lucas' photo.",
    "trailerLink": "https://www.youtube.com/watch?v=uj30xMRf2YI"
  }
  
]
